app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "mayemi"], ["email", "doris@gmail.com"], ["created_at", "2020-12-01 09:50:29.461506"], ["updated_at", "2020-12-01 09:50:29.461506"]]
---
  def create
    @user = User.new(user_params)
    @user.name = params[:user][:name]
    @user.email = params[:user][:email]
    @user.save